## 1. 데이터 불러오기

In [1]:
import pandas as pd
import numpy as np

In [2]:
selloutData = pd.read_csv("../dataset/kopo_channel_seasonality_new.csv")
#head는 요약해서 몇줄만 불러오는거
selloutData.head()

  REGIONID    PRODUCT  YEARWEEK      QTY
0      A60   PRODUCT4    201402     71.0
1      A60  PRODUCT59    201402  22275.0
2      A60  PRODUCT34    201402   4463.0
3      A60  PRODUCT47    201402      0.0
4      A60  PRODUCT56    201402     23.0

## 2. 데이터 타입 조회 / 변환

In [3]:
selloutData.dtypes

REGIONID     object
PRODUCT      object
YEARWEEK      int64
QTY         float64
dtype: object

In [4]:
#데이터 타입 변환 방법 2
selloutData["YEARWEEK"] = selloutData["YEARWEEK"].astype(str)
selloutData["REGIONID"] = selloutData["REGIONID"].astype(str)
selloutData["PRODUCT"] = selloutData["PRODUCT"].astype(str)
selloutData["QTY"] = selloutData["QTY"].astype(str)

In [5]:
#데이터 타입 변환 방법 2
selloutData["YEARWEEK"] = selloutData.YEARWEEK.astype("str")
selloutData["REGIONID"] = selloutData.REGIONID.astype("str")
selloutData["PRODUCT"] = selloutData.PRODUCT.astype("str")
selloutData["QTY"] = selloutData.QTY.astype("float")

In [6]:
selloutData.dtypes

REGIONID     object
PRODUCT      object
YEARWEEK     object
QTY         float64
dtype: object

## 3. 특정 컬럼만 조회하기

### 실습 1)

In [7]:
selloutData[['REGIONID','PRODUCT']].head()

  REGIONID    PRODUCT
0      A60   PRODUCT4
1      A60  PRODUCT59
2      A60  PRODUCT34
3      A60  PRODUCT47
4      A60  PRODUCT56

## 3. [불량 데이터 처리] QTY 마이너스 값을 0으로 변경

In [8]:
selloutData.head()

  REGIONID    PRODUCT YEARWEEK      QTY
0      A60   PRODUCT4   201402     71.0
1      A60  PRODUCT59   201402  22275.0
2      A60  PRODUCT34   201402   4463.0
3      A60  PRODUCT47   201402      0.0
4      A60  PRODUCT56   201402     23.0

In [9]:
selloutData["QTY_NEW"] = np.where(selloutData["QTY"]<0, 0,selloutData["QTY"])
selloutData.head()

  REGIONID    PRODUCT YEARWEEK      QTY  QTY_NEW
0      A60   PRODUCT4   201402     71.0     71.0
1      A60  PRODUCT59   201402  22275.0  22275.0
2      A60  PRODUCT34   201402   4463.0   4463.0
3      A60  PRODUCT47   201402      0.0      0.0
4      A60  PRODUCT56   201402     23.0     23.0

## 4. 53주차 제거 및 YEAR,WEEK 컬럼 생성

In [10]:
selloutData["YEARWEEK"] = selloutData["YEARWEEK"].astype(str)
selloutData["REGIONID"] = selloutData["REGIONID"].astype(str)
selloutData["PRODUCT"] = selloutData["PRODUCT"].astype(str)
selloutData["QTY"] = selloutData["QTY"].astype(int)

In [11]:
selloutData["YEAR"] = selloutData.YEARWEEK.str[0:4]
selloutData["WEEK"] = selloutData.YEARWEEK.str[4:]
selloutData.head()

  REGIONID    PRODUCT YEARWEEK    QTY  QTY_NEW  YEAR WEEK
0      A60   PRODUCT4   201402     71     71.0  2014   02
1      A60  PRODUCT59   201402  22275  22275.0  2014   02
2      A60  PRODUCT34   201402   4463   4463.0  2014   02
3      A60  PRODUCT47   201402      0      0.0  2014   02
4      A60  PRODUCT56   201402     23     23.0  2014   02

In [12]:
#53주차가 있는지 검색해보기
selloutData[selloutData.WEEK.astype(int)==53].head()

      REGIONID    PRODUCT YEARWEEK    QTY  QTY_NEW  YEAR WEEK
62075      A64  PRODUCT63   201553   2092   2092.0  2015   53
62076      A64  PRODUCT15   201553     80     80.0  2015   53
62077      A64   PRODUCT4   201553   1781   1781.0  2015   53
62078      A64  PRODUCT16   201553      8      8.0  2015   53
62079      A64  PRODUCT59   201553  24242  24242.0  2015   53

In [13]:
selloutData["WEEK"].astype(int).max()

53

In [14]:
selloutData.dtypes

REGIONID     object
PRODUCT      object
YEARWEEK     object
QTY           int32
QTY_NEW     float64
YEAR         object
WEEK         object
dtype: object

In [45]:
selloutData["YEAR"] = selloutData.YEAR.astype(int)
selloutData["WEEK"] = selloutData.WEEK.astype(int)

In [46]:
selloutData.dtypes

REGIONID     object
PRODUCT      object
YEARWEEK     object
QTY           int32
QTY_NEW     float64
YEAR          int32
WEEK          int32
dtype: object

In [98]:
refinedSelloutData = selloutData["WEEK"] <= 52

In [99]:
#형변환, 변수에 담기 한번에 하기
refinedSelloutData = selloutData[selloutData.WEEK.astype(int)<=52]

###  QTY 에서  평균과 표준편차를 구하기 (QTY가 int형이어야 함)

In [100]:
groupKey = ['REGIONID','PRODUCT']

In [101]:
groupD = refinedSelloutData.groupby(groupKey).mean()[["QTY_NEW"]]
groupD.head()

                          QTY_NEW
REGIONID PRODUCT
A00      PRODUCT34     133.057692
         PRODUCT58     105.250000
         PRODUCT59   35957.570513
A01      PRODUCT1     5712.775641
         PRODUCT12  196825.403846

### QTY 에서  평균과 표준편차를 구하기 (QTY가 int형이어야 함)

In [156]:
groupkey = ['REGIONID','PRODUCT','YEAR']

In [157]:
# 평균 및 표준편차 구하기
groupData = selloutData.groupby(groupkey).agg(['mean','std'])["QTY"]
groupData.head()

                               mean         std
REGIONID PRODUCT   YEAR
A00      PRODUCT34 2014  275.961538  162.179634
                   2015   85.698113   72.858024
                   2016   36.576923   94.897539
         PRODUCT58 2014    2.673077    3.889257
                   2015    7.547170   14.909427

In [127]:
sortedData = ['REGIONID','PRODUCT','YEARWEEK']

### agg는 조건을 받아주는 함수

In [159]:
sortedData = selloutData.groupby(groupkey).agg(['mean','std'])["QTY_NEW"]
sortedData.head()

                               mean         std
REGIONID PRODUCT   YEAR
A00      PRODUCT34 2014  275.961538  162.179634
                   2015   85.698113   72.858024
                   2016   36.576923   94.897539
         PRODUCT58 2014    2.673077    3.889257
                   2015    7.547170   14.909427

### 컬럼 이름 바꾸기

In [129]:
sortedData.columns=['QTY_MEAN','QTY_STD']
sortedData.head()

                           QTY_MEAN     QTY_STD
REGIONID PRODUCT   YEAR
A00      PRODUCT34 2014  275.961538  162.179634
                   2015   85.698113   72.858024
                   2016   36.576923   94.897539
         PRODUCT58 2014    2.673077    3.889257
                   2015    7.547170   14.909427

### reset_index()을 해야 칼럼명 정렬이 아래와 같음

In [130]:
yes=sortedData.reset_index()
yes.head()

  REGIONID    PRODUCT  YEAR    QTY_MEAN     QTY_STD
0      A00  PRODUCT34  2014  275.961538  162.179634
1      A00  PRODUCT34  2015   85.698113   72.858024
2      A00  PRODUCT34  2016   36.576923   94.897539
3      A00  PRODUCT58  2014    2.673077    3.889257
4      A00  PRODUCT58  2015    7.547170   14.909427

### 데이터 합치기

In [131]:
sortKey =  ['REGIONID','PRODUCT','YEARWEEK']

In [145]:
sortedData1 = refinedSelloutData.sort_values(sortKey).head()

In [146]:
sortedData1.head()

     REGIONID    PRODUCT YEARWEEK  QTY  QTY_NEW  YEAR  WEEK
298       A00  PRODUCT34   201401  661    661.0  2014     1
1757      A00  PRODUCT34   201402  679    679.0  2014     2
3125      A00  PRODUCT34   201403  578    578.0  2014     3
205       A00  PRODUCT34   201404  532    532.0  2014     4
4369      A00  PRODUCT34   201405  516    516.0  2014     5

In [133]:
# refindSelloutData["MA"]

In [134]:
# 어떤 그룹에 대해서만 롤링 을 해야한다고?
# 롤링함수를 만들어서 그 지역에서만 롤링을 하고 이렇게 하기 위해서 그룹바이를 하는거임
# 각각 그룹바이의 가장 큰 장점은 내가 분석하고 싶은 주제의 각 평균을 구할 수 있는거
# 그룹을 분리시켜서 각 그룹의 평균을 구하는데, 

# 내가 쓸 수 있느 ㄴ함수를 막 쓰는게 아니기 때문이ㅏㄷ.

In [135]:
#join의 두 종류
#inner join : 교집합만 합치는거  merge 란 왼쪽, 오른쪽 데이터에 자료값이 다 있을 경우에만 합쳐지고, 한쪽이라도 없는 정보는 버림
#left join: 왼쪽 항목을 다 유지한 상태에서 오른쪽 값을 붙임

In [151]:
# 데이터 조인 
#left on: 저 컬럼을 기준으로 합치겠다. 라는거 (왜 left와 right가 따로 있냐면 내용은 같지만 
#컬럼명이 다를 수 있기 때문이다. 내용이 같다면 그 합치고자 하는 컬럼명을 쓰면 된다. )
mergedData= pd.merge(sortedData1, yes,\
                     left_on=["REGIONID", "PRODUCT", "YEAR"], right_on = ["REGIONID", "PRODUCT", "YEAR"], 
                     how = "left")\
[["REGIONID","PRODUCT","YEARWEEK","YEAR","WEEK","QTY_NEW","QTY_MEAN","QTY_STD"]]

In [150]:
mergedData.head()

  REGIONID    PRODUCT YEARWEEK  YEAR  WEEK  QTY_NEW    QTY_MEAN     QTY_STD
0      A00  PRODUCT34   201401  2014     1    661.0  275.961538  162.179634
1      A00  PRODUCT34   201402  2014     2    679.0  275.961538  162.179634
2      A00  PRODUCT34   201403  2014     3    578.0  275.961538  162.179634
3      A00  PRODUCT34   201404  2014     4    532.0  275.961538  162.179634
4      A00  PRODUCT34   201405  2014     5    516.0  275.961538  162.179634